# Assignment 1 - loop and list

# Scenario 1:
    User enters a number:
    options: 
    1 --> original
    2 --> square
    3 --> Cube

In [1]:
A = int(input("Enter your number:"))
Original = A
Squre = A**2
Cube = A**3
print("Original number is %d, \nSqure of this number is %d, \nCube of this number is %d"%(Original, Squre, Cube))

Enter your number:4
Original number is 4,
Squre of this number is 16,
Cube of this number is 64

# Scenario 2
    A = [17,19,21,31,91,76,45,26,91]
    squares = []
    cubes = []

In [2]:
A = [17,19,21,31,91,76,45,26,91]
squares = []
cubes = []
for i in A:
    if (i%2==0):
        squares.append(i)
    else:
        cubes.append(i)

In [3]:
squares

[76, 26]

In [4]:
cubes

[17, 19, 21, 31, 91, 45, 91]

# Scenario 3:
    A = [17,19,21,31,91,76,45,26,91]
    even = []
    odd = []

In [5]:
A = [17,19,21,31,91,76,45,26,91]
even = []
odd = []
for i in A:
    if (i%2==0):
        even.append(i)
    else:
        odd.append(i)

In [6]:
even

[76, 26]

In [7]:
odd

[17, 19, 21, 31, 91, 45, 91]

# Scenario 4:
    A = [17,19,21,31,91,76,45,26,91]
    B = []
    Find out squares of first 5 numbers and cubes of the remaining numbers from the list A.

In [8]:
A = [17,19,21,31,91,76,45,26,91]

In [9]:
B = []
for i in range(0,len(A),1):
    if i<5:
        B.append(A[i]**2)
    else:
        B.append(A[i]**3)

In [10]:
B

[289, 361, 441, 961, 8281, 438976, 91125, 17576, 753571]

# Assingment 2 - Hitters

In [12]:
import os
os.chdir('d:/Datasets/')

In [13]:
import pandas as pd
A= pd.read_csv("hitters.csv")

In [14]:
A.head()

,Name,AtBat,Hits,HmRun,Runs,RBI,Walks,Years,CAtBat,CHits,...,CRuns,CRBI,CWalks,League,Division,PutOuts,Assists,Errors,Salary,NewLeague
0,Andy Allanson,293,66,1,30,29,14,1,293,66,...,30,29,14,A,E,446,33,20,NaN,A
1,Alan Ashby,315,81,7,24,38,39,14,3449,835,...,321,414,375,N,W,632,43,10,475.0,N
2,Alvin Davis,479,130,18,66,72,76,3,1624,457,...,224,266,263,A,W,880,82,14,480.0,A
3,Andre Dawson,496,141,20,65,78,37,11,5628,1575,...,828,838,354,N,E,200,11,3,500.0,N
4,Andres Galarraga,321,87,10,39,42,30,2,396,101,...,48,46,33,N,E,805,40,4,91.5,N

## Find of people who have batted for more than 400 matches

In [15]:
A[A.AtBat>400][["Name"]]

                Name
2        Alvin Davis
3       Andre Dawson
5    Alfredo Griffin
9     Andre Thornton
10     Alan Trammell
..               ...
317     Willie McGee
318  Willie Randolph
319   Wayne Tolleson
320    Willie Upshaw
321    Willie Wilson

[151 rows x 1 columns]

# Find out the name of the player who has hit max home runs

In [ ]:
A.head()

In [17]:
A.sort_values(by=["HmRun"],ascending=False)[["Name","HmRun"]].head(1)

               Name  HmRun
136  Jesse Barfield     40

# Find out league wise total number of players

In [ ]:
A.head()

In [21]:
A.groupby(by=("League")).count()["Name"]

League
A    175
N    147
Name: Name, dtype: int64

# Find out division wise total amount of salary invested

In [ ]:
A.head()

In [22]:
A.groupby(by="Division").Salary.sum()

Division
E    80531.006
W    60417.501
Name: Salary, dtype: float64

# Find out five most senior players.

In [23]:
A.sort_values(by=["Years"],ascending=False)[["Name", "Years"]].head()

               Name  Years
236       Pete Rose     24
302      Tony Perez     23
121   Graig Nettles     20
249  Reggie Jackson     20
306     Ted Simmons     19